export const enum CODE {
  SUCCESS = 0,
  /** 用户不存在 */
  USER_NOT_EXITS = -1001,
  /** 密码不正确 */
  USER_PASSWORD_ERR = -1005,
  /** 用户不合法 */
  USER_ERROR = -1002,
  /** token失效 */
  TOKEN_EXP = -1003,
  /** token不合法 */
  TOKEN_ERROR = -1004,
  /** 文件格式错误 */
  FILE_NOT_LIMIT = -1023,
  /** 值重复 */
  SAME_VALUE = -1024,
  /** 值不存在 */
  VALUE_NOT_EXITS = -1025,
  /** 产品信息不存在 */
  PRO_NOT_EXITS = -1028,
  /** 暂无权限 */
  UN_JURISDICTION = -9998,
  /** 参数不合法 */
  PARAM_ERROR = -9999,
  /** 参数不合法 */
  SENTRY_ERROR = -9997
}

export const codeMsg = {
  [-1001]: '该用户不存在',
  [-1002]: '用户不合法',
  [-1003]: '登录已失效,请重新登录',
  [-1004]: 'token不合法',
  [-1005]: '密码不正确',
  [-1023]: '存在错误的文件格式',
  [-1024]: '存在相同的值,请更改',
  [-1025]: '操作的值不存在',
  [-1028]: '产品不存在',
  [-1031]: '驳回理由不能为空',
  [-1032]: '该条信息还有未审核的审核项',
  [-9997]: 'Sentry操作错误',
  [-9998]: '暂无操作权限',
  [-9999]: '参数不合法,请检查参数'
}
